Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: རིན་པོ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་པ་རྨད་དུ་བྱུང་བ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་སྤ་བར་སྤྲས་ཏེ།
en: It was beautified by the adornment of the entire variety of inconceivable, wonderful jewels.

source: རྣམ་པ་ཐམས་ཅད་དུ་མཛེས་པར་བརྒྱན་པ།
en: It was adorned with every kind of beauty.

source: ཡུ་བ་རིན་པོ་ཆེའི་རྒྱལ་པོ་བཻཌཱུརྱ་སྔོན་པོ་ལས་བསྒྲེང་བས་ནི་བསྐྱབས།
en: It had a great precious parasol that was held aloft by a pole of blue beryls, the kings of jewels.

source: སྲོག་ཆགས་བརྒྱ་སྟོང་མང་པོས་ནི་ཡོངས་སུ་བསྐོར།
en: It was encircled by many hundreds of thousands of beings.

source: རོལ་མོ་བརྒྱ་སྟོང་མང་པོ་ལྷ་རྫས་ཀྱི་དབྱངས་ཡིད་དུ་འོང་བ་སྙན་པ་དང་ལྡན་པ་དག་ནི་རབ་ཏུ་བླངས།
en: The beautiful, melodious sound of music arose from hundreds of thousands of musical instruments.

source: མེ་ཏོག་གི་ཆར་ཆེན་པོ་ནི་མངོན་པར་འབབ།
en: A great rain of flowers fell.

source: ལྷ་རྫས་ཀྱི་སྤོས་དྲི་ཞིམ་པའི་བདུག་སྤོས་ཀྱི་སྣོད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ནི་རབ་ཏུ་བདུག་ཅིང་འགྲོ་བར་གྱུར་ཏོ།
en: A divine, beautiful aroma spread from a quintillion censers. That was the way he went to the park.

source: །དེ་དེ་ལྟར་འགྲོ་བའི་ཚེ་ལམ་ཡང་རྒྱུད་བརྒྱད་དང་ལྡན་པར་གྱུར་ཏེ།
en: “As he proceeded, at that time, the road became eight vehicles wide, without any unevenness, and without pebbles or gravel.

source: མཐོན་དམན་མྱེད་པ་དང་། གསེག་མ་དང་གྱོ་མོ་མྱེད་པ་དང་། གསེར་དངུལ་དང་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱི་ཁམས་ཀྱིས་སའི་གཞི་རབ་ཏུ་བསྒྲུབས་པ་དང་། གསེར་གྱི་བྱེ་མ་བཀྲམ་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་སིལ་མས་ཆལ་བར་གང་བ་དང་། གཡས་གཡོན་ནས་རིན་པོ་ཆེའི་ཤིང་གི་ཕྲེང་བས་དགྲིགས་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་རན་བཀྱེ་བ་དང་། སྟེང་ནས་རིན་པོ་ཆེའི་དྲིལ་བུའི་དྲ་བ་བྲེས་པ་དང་། རིན་པོ་ཆེའི་གནམ་ཡོལ་སྣ་ཚོགས་ཀྱིས་བཀབ་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་མཚན་དང་། བ་དན་དང་། སྣམ་བུ་བརྒྱ་སྟོང་རབ་ཏུ་བརྒྱན་པ་དུ་མ་བསྒྲེང་ཞིང་སྦྱངས་པས་མཛེས་པར་བརྒྱན་པ་དང་། གཡས་གཡོན་ནས་རིན་པོ་ཆེའི་སྟེགས་བུའི་ཕྲེང་བ་རྣམ་པར་བཀོད་པས་རྣམ་པར་བརྒྱན་པ་སྟེ།
en: The ground was made from the elements of gold, silver, and the various kinds of jewels. It was bestrewn with gold dust. It was covered with the scattered petals of flowers made of every kind of jewel. On both sides were rows of jewel trees on bases made of all kinds of jewels. Above there was a network of strings of precious bells and jingle bells.

source: རིན་པོ་ཆེའི་སྟེགས་བུ་ལ་ལ་ལ་ནི་སློངས་མོ་བའི་ཚོགས་ལ་ཡོངས་སུ་བསྟབས་པའི་དོན་དུ་རིན་པོ་ཆེའི་སྣོད་སྣ་ཚོགས།
en: It was covered by a variety of precious canopies.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཀང་བ་བཀོད།
en: It was perfectly adorned by a beautiful display of countless hundreds of thousands of erected precious banners, flags, and hanging streamers. “On both sides, it was adorned by an arrangement of rows of precious platforms. “On some platforms, a variety of precious bowls filled with a variety of jewels had been arranged for the crowds of petitioners.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་རྒྱན་འདོད་པའི་སློངས་མོ་བ་རྣམས་བརྒྱན་པའི་དོན་དུ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་རྣམ་པ་ཡོངས་སུ་བཀོད།
en: “On some platforms, all kinds of precious adornments had been placed for those who requested adornments.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེ་བཀོད།
en: “On some platforms, wish-fulfilling jewels had been set out in order to fulfill the wishes of all beings.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་སུ་ཅི་འདོད་པ་དེ་དག་ལ་དེ་སྦྱིན་པའི་དོན་དུ་ཁ་ཟས་དང་བཏུང་བ་དང་། བྲོ་བ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཀང་བའི་སྣོད་མང་པོ་བཀོད།
en: “On some platforms, many vessels containing food and drink with flavors of various kinds had been set out so as to provide whatever was desired.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་མཆོག་ཏུ་ཞིམ་པའི་རོ་དང་། ཁ་དོག་དང་དྲི་དང་། བྲོ་དང་། རེག་ཡིད་དུ་འོང་བ་དང་ལྡན་པའི་ལྷ་རྫས་ཀྱི་ཁ་ཟས་ཀྱི་རྣམ་པ་བཀོད།
en: “On some platforms, divine food with the most perfect flavors, colors, aromas, tastes, and pleasant textures had been provided.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་རོ་བྲོ་བ་སྣ་ཚོགས་དང་ལྡན་པའི་ལྷ་རྫས་ཀྱི་ཤིང་ཏོག་སྣ་ཚོགས་ཐམས་ཅད་སྤུངས།
en: “On some platforms, divine fruits of every kind with a variety of flavors had been heaped up.

source: སྟེགས་བུ་ལ་ལ་ལ་ནི་གོས་འདོད་པ་རྣམས་ཡིད་བཞིན་དུ་སྤྱོད་དུ་གཟུད་པའི་ཕྱིར་ལྷ་རྫས་ཀྱི་གོས་རིན་པོ་ཆེ་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ་མདོག་བཟང་པོ་རྣམ་པ་སྣ་ཚོགས་དག་དང་རི་མོ་སྣ་ཚོགས་ཤིན་ཏུ་སྤ་བར་རྣམ་པར་ཕྱེ་བ་ཤིན་ཏུ་བཙུན་པ་ལ་འོས་པ་ཤིན་ཏུ་ཕྲ་བ། རབ་ཏུ་འཇམ་པ། ཐགས་སུ་མ་བཏགས་པ། བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་སྙེད་ཡོངས་སུ་བཀོད་པར་གྱུར་ཏོ།
en: “On some platforms were set out trillions of divine, precious clothes for those who desired clothes to enjoy in accordance with their wishes. They were not woven on a loom, had various kinds of beauty and all kinds of excellent colors, were adorned with various designs, and were very noble, worthy, fine, and perfectly smooth.

source: །སྟེགས་བུ་ལ་ལ་ལ་ནི་བྱུག་པ་འདོད་པའི་སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྤྱོད་དུ་གཟུང་པའི་ཕྱིར། །ལྷ་རྫས་ཀྱི་སྤོས་ཀྱི་རྣམ་པ་ཁ་དོག་དང་། དྲི་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་ལྡན་པ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ།
en: “On some platforms were arranged all kinds of divine aromatic substances, with various colors and aromas, for those who wished to perfume themselves to enjoy in accordance with their wishes.

source: །སྟེགས་སུ་བུ་ལ་ལ་ལ་ནི་སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྤྱོད་དུ་གཟུད་པའི་ཕྱིར་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་ཕུང་པོ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ།
en: “On some platforms, heaps of various artifacts had been arranged for beings to enjoy in accordance with their wishes.

source: །སྟེགས་བུ་ལ་ལ་ལ་ནི་ན་ཆུང་གཟུགས་བཟང་བ་རབ་ཏུ་མཛེས་པ་ཤིན་ཏུ་སྡུག་པ། ཆ་ལུགས་སྡུག་གུ་སྣ་ཚོགས་དང་ལྡན་པ་ཡིད་དུ་འོང་བའི་གོས་སྣ་ཚོགས་གྱོན་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་མཛེས་པར་བརྒྱན་པ། བྱུག་པ་སྣ་ཚོགས་ཀྱིས་ཚུལ་སྡུག་གུར་བརྒྱན་ཅིང་མཛེས་པར་བྱས་པའི་ལུས་དང་ལྡན་པ། བུད་མྱེད་ཀྱི་བཟོ་དང་སྒྱུ་དང་། ཤེས་ཉེན་གྱི་ཚུལ་ལ་མཁས་པ་དག་ཀྱང་བཀོད་པར་གྱུར་ཏོ།
en: “On some platforms were arranged beautiful, charming, attractive women with a variety of pleasing appearances, their bodies beautified by being dressed in a variety of beautiful clothes, beautifully adorned by every kind of jewelry, perfumed by a variety of scents, and skilled in the female crafts and arts.

source: །དེའི་ཚེ་རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་དེ་ཉིད་ན་སྤྲུལ་འཚོང་མའི་དམ་པ་རྒྱལ་པོའི་ལོངས་སྤྱོད་དུ་འོས་པ། བལྟ་ན་མཛེས་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ།
en: “At that time, in the royal capital Druma­meru­śrī, there was the preeminent courtesan called Sudarśanā, who was worthy to be enjoyed by the king.

source: དེའི་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ཞེས་བྱ་བ་གཟུགས་བཟང་ཞིང་ཤིན་ཏུ་མཛེས་པ། བལྟ་ན་སྡུག་པ་ཧ་ཅང་ཡང་མི་རིང་ཧ་ཅང་ཡང་མི་ཐུང་། ཧ་ཅང་ཡང་མི་སྦོམ། ཧ་ཅང་ཡང་མི་ཕྲ། ཧ་ཅང་ཡང་མི་དཀར། ཧ་ཅང་ཡང་མི་སྔོ་བ། སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ། མྱིག་དཀར་ནག་འབྱེས་པ། བཞིན་ཡིད་དུ་འོང་བ། ཚངས་པའི་དབྱངས་དང་ལྡན་པ།
en: She had a daughter named Sucalita­rati­prabhāsa­śrī, who was beautiful, with a lovely body, attractive, not too tall and not too short, not too plump and not too thin, not too white and not too dark, and with deep black hair, deep black eyes, a beautiful face, and a voice like Brahmā’s;

source: འཇམ་ཞིང་སྙན་པར་སྨྲ་བ། ཤེས་རབ་དང་ལྡན་པ། ཤེས་ཉེན་གྱི་ཚུལ་ཐམས་ཅད་ལ་མཁས་པ་གཙུག་ལག་ཐམས་ཅད་ལ་ཤེས་པ། བརྩོན་པ། ལེ་ལོ་མྱེད་པ། རིམ་འགྲོ་ཡོད་པ། མོས་པ་དང་ལྡན་པ། བྱམས་པའི་སེམས་འདོགས་པ། ཁོང་ཁྲོ་བ་མི་མངའ་བ།
en: who spoke gently and pleasantly, was wise, and was skilled in all the arts;

source: བལྟ་ན་མི་ངོམས་ཤིང་ཡིད་དུ་འོང་བ། འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ཆུང་བ། ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ། དྲང་ཞིང་མཉེན་པ། གཡོ་དང་སྒྱུ་མེད་པ་ཞིག་ཡོད་དེ།
en: and who knew all treatises, was diligent, was not lazy, was respectful, was gracious, had a kind mind, was not aggressive, was so attractive that one never tired of gazing upon her, had little desire, anger, or ignorance, had a sense of decorum and modesty, was honest and gentle, and had no deceit or trickery.

source: དེ་མ་དང་ལྷན་ཅིག་ཏུ་བུ་མོ་དུ་མ་ཞིག་གིས་ཡོངས་སུ་བསྐོར་ཏེ། རིན་པོ་ཆེའི་ཤིང་རྟ་ལ་ཞོན་ནས་རྒྱལ་པོའི་གནས་སྡོང་པོ་རི་བོའི་དཔལ་ནས་བྱུང་སྟེ།
en: “She mounted a precious carriage with her mother and accompanied by many girls, and they came out from Druma­meru­śrī.

source: རྒྱལ་པོས་བཀའ་སྩལ་ནས། རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་མདུན་ནས། ཕར་རྒྱལ་བུ་གཞོན་ནུ་དེ་གླུ་ལེན་ཞིང་འདོང་འདོང་བ་ལས།
en: At the king’s command, they sought out the young prince Tejodhipati so as to sing before him.

source: རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་མཐོང་ནས། འདོད་ཆགས་ཀྱིས་སེམས་ཤིན་ཏུ་མི་བཟང་པ་ཞིག་གཡོས་ཏེ།
en: “When Sucalita­rati­prabhāsa­śrī saw Prince Tejodhipati, her mind was shaken by overwhelming desire.

source: རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ཤིན་ཏུ་ཡིད་དུ་འོང་ཆེས་ནས་རྗེས་སུ་འབྲང་ཞིང་སེམས་ལ་རང་དབང་མེད་པས།
en: The beauty of Prince Tejodhipati was so great she helplessly followed him.

source: བལྟ་ན་སྡུག་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “She said to her mother Sudarśanā, ‘Mother, know this:

source: །མ་འདི་ལྟར་མཁྱེན་པར་མཛོད་ཅིག །གལ་ཏེ་བདག་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་མ་བཏད་ན་ནི་འགུམ་པ་འམ།
en: I will die if I am not given to this Prince Tejodhipati!

source: སྲོག་ལ་འབབ་པའི་སྡུག་བསྔལ་གཅིག་ཏུ་འགྱུར་རོ།
en: The suffering will bring me to death!’

source: དེས་སྨྲས་པ། བུ་མོ་དེ་ལྟ་བུའི་སེམས་མ་སྐྱེད་ཅིག །གཞོན་ནུ་འདི་ནི་འཁོར་ལོས་སྒྱུར་བའི་མཚན་དང་ལྡན་པ་སྟེ།
en: Sudarśanā replied, ‘My daughter, don’t have such an aspiration! This youth has the signs of a cakravartin.

source: དེའི་ཡབ་ནོར་གྱི་བདག་པོ་མི་བཞུགས་པར་གྱུར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་ལ་གནས་པར་འགྱུར་བའི་གནས་ཡོད་དོ།
en: When his father Dhanapati is no longer with us, he will rule a cakravartin’s kingdom.

source: །དེ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བས། དེའི་བུད་མེད་རིན་པོ་ཆེ་ནམ་མཁའ་ལ་འགྲོ་བ་འབྱུང་བར་འགྱུར་ལ།
en: When he has become a cakravartin, he will have a precious queen who will come flying through the air.

source: བུ་མོ་བདག་ཅག་ཀྱང་། སྦྲུལ་འཚོང་མ་དག་ཅིག་སྟེ། འཇིག་རྟེན་ཐམས་ཅད་དགའ་བར་བྱེད་པ་ཡིན་གྱི།
en: My daughter, we are courtesans who bring pleasure to the entire world.

source: ཡུ་བུས་སེམས་ཅན་འགའ་ཞིག་ལ་ནམ་འཚོའི་བར་དུ་བསྙེན་བཀུར་མྱི་བྱར་མྱི་རུང་བའང་མྱེད་དེ།
en: We do not and cannot remain throughout our lifetime serving only one being.

source: ཡུ་བུ་ནི་རྒྱལ་པོ་ནོར་གྱི་བདག་པོའི་བཀས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་རིམ་འགྲོར་འདོང་འདོང་བར་ཟད་ཀྱིས་དེ་ལྟ་བུའི་སེམས་བརྟན་པར་མ་བྱེད་ཅིག །གནས་དེ་ནི་ཐོབ་པར་ཡང་ཤིན་ཏུ་དཀའོ།
en: King Dhanapati commanded us to come before the young prince Tejodhipati only to show our respect! That kind of status would be too difficult to attain.’

source: །དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐུ་ཉི་མ་དམ་པ་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པར་བླ་ན་མྱེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་ལྷ་དང་། མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “At that time, in that world there appeared a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who was named Sūrya­gātra­pravara.

source: དེའི་སྙིང་པོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ཅེས་བྱ་བ་ཡང་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ལས་འོད་ཀྱི་སྤྲིན་འབྱུང་བ་ཞེས་བྱ་བ་དེའི་ནང་དུ་བྱུང་སྟེ།
en: “His bodhimaṇḍa, called Dharma­meghodgata­prabhā, was near to the Gandhāṅkura­prabha­megha Park.

source: དེར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྐུ་ཉི་མ་དམ་པ་ཐོག་མར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: It had been seven days since the Bhagavat, the Tathāgata Sūrya­gātra­pravara had attained complete buddhahood there.

source: ཞག་བདུན་ལོན་པ་དེ་བུ་མོ་དེ་ཤིང་རྟ་ལ་ཞོན་བཞིན་དུ་ཡུར་ཞིང་འཆོག་འཆོག་པའི་རྨི་ལམ་དུ་མཐོང་ནས་སད་པར་གྱུར་པ་དང་། སྔོན་གཉེན་བཤེས་སུ་གྱུར་པའི་ལྷ་མོ་ཞིག་གིས་བསྟན་པ།
en: The girl, while in her carriage, nodded off to sleep and saw him in a dream.

source: བུ་མོ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཉི་མ་དམ་པ་དེ་ནི་སྙིང་བོ་བྱང་ཆུབ་ཆོས་ཀྱི་སྤྲིན་ཤིན་ཏུ་སྡུག་པའི་འོད་ཅེས་བྱ་བ་ན་རྣམ་པར་སྤྱོད་ཅིང་ཐོག་མ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཞག་བདུན་ལོན་ཏེ།
en: When she woke up, a goddess, who in past times had been a relative, declared to her, ‘Girl, the Tathāgata Sūrya­gātra­pravara is present in the Dharma­meghodgata­prabhā bodhimaṇḍa, after his first seven days since attaining complete buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཚངས་པ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མྱིན་གྱི་ལྷའི་ཚོགས་ཀྱིས་མདུན་དུ་བྱས་ཤིང་བཞུགས་ཏེ།
en: He is encircled by an assembly of bodhisattvas, and before him are gathered assemblies of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Brahmakāyika deities, Ābhāsvara deities, and Akaniṣṭha deities.

source: དེར་སའི་ལྷ་མོ་ཐམས་ཅད་ཀྱང་ཀུན་ནས་འདུས། ཆུའི་ལྷ་མོ་དང་། མྱེའི་ལྷ་མོ་དང་། རླུང་གི་ལྷ་མོ་དང་། རྒྱ་མཚོའི་ལྷ་མོ་དང་། ཆུ་ཀླུང་གི་ལྷ་མོ་དང་། རིའི་ལྷ་མོ་དང་། མཚན་མོའི་ལྷ་མོ་དང་། སྐྱ་རེངས་འཆར་བའི་ལྷ་མོ་དང་། ནགས་ཚལ་གྱི་ལྷ་མོ་དང་། ཤིང་གི་ལྷ་མོ་དང་། སྨན་གྱི་ལྷ་མོ་དང་། ལོ་ཐོག་གི་ལྷ་མོ་དང་། གྲོང་ཁྱེར་གྱི་ལྷ་མོ་དང་། རྐང་གིས་འགྲོ་བའི་ལྷ་མོ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་དང་། ལུས་ཀྱི་འོད་གཟེར་གྱི་ལྷ་མོ་དང་། སེམས་ཅན་གྱི་རིས་ཀྱི་ལྷ་མོ་དང་། ནམ་མཁའི་ལྷ་མོ་དང་། ཕྱོགས་ཐམས་ཅད་ཀྱི་ལྷ་མོ་དག་ཀྱང་བཅོམ་ལྡན་འདས་སྐུ་ཉི་མ་དམ་པའི་ཞལ་བལྟ་བའི་ཕྱིར་ཀུན་ནས་འདུས་སོ་ཞེས་ནས།
en: Also gathered there to gaze upon the Tathāgata Sūrya­gātra­pravara are all goddesses of the earth, goddesses of water, goddesses of fire, goddesses of the air, goddesses of the oceans, goddesses of the rivers, goddesses of the mountains, goddesses of the night, goddesses of the dawn, goddesses of the forests, goddesses of the trees, goddesses of herbs, goddesses of harvests, goddesses of towns, goddesses of footpaths, goddesses of the bodhimaṇḍas, goddesses of the body’s light rays, goddesses of classes of beings, goddesses of the sky, and goddesses from all directions.’

source: དེ་ལྟར་དེས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐོས་པས་བག་ཚ་མྱེད་པ་ཐོབ་པར་གྱུར་ཏེ།
en: “When Sucalita­rati­prabhāsa­śrī had seen the Tathāgata and heard of the qualities of the Tathāgata, she attained a state of serenity.

source: སྐབས་སུ་བབ་ནས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོའི་མདུན་དུ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: When the opportunity came, she recited these verses before Prince Tejodhipati:

source: །གཟུགས་ཀྱི་མཆོག་གིས་འཇིག་རྟེན་ཁྱད་པར་འཕགས།
en: ‘I am preeminent in this world because of my excellent body.

source: །ཡོན་ཏན་རྣམས་ཀྱིས་ཐམས་ཅད་ཕྱོགས་སུ་གྲགས།
en: My qualities are renowned in all directions.

source: །ཤེས་རབ་སྟོབས་ཀྱིས་བདག་དང་འདྲ་མ་མཆིས།
en: Because of the power of my wisdom, there is no one like me.

source: །སྒྱུ་རྩལ་དགའ་བ་སྒྱུ་མའི་ཚུལ་ཀུན་འཚལ།
en: I am learned in all the arts and skills of pleasure.

source: །སྲོག་ཆགས་མང་པོ་སྟོང་ཕྲག་དུ་མ་ཡིས།
en: ‘There are many thousands of beings

source: །འདོད་ཆགས་དབང་གིས་བདག་ལ་རབ་བལྟས་ཀྱང་།
en: Who gaze upon me with desire.

source: །གཞོན་ནུ་བདག་ནི་འཇིག་རྟེན་གང་ལ་ཡང་།
en: Prince, I have had no desire within me

source: །གློ་བ་ཆགས་པར་གྱུར་པ་གཅིག་མ་མཆིས།
en: For anyone in this world.

source: །སེམས་ཅན་གང་ལ་ཡང་ཞེན་པར་གྱུར་པ་འམ།
en: ‘I have no attachment toward any being.

source: །གང་ལའང་ཁོང་ཁྲོར་བདག་གི་སེམས་མ་གྱུར།
en: In my mind there is no anger toward anyone.

source: །གང་ལའང་དགྲ་མྱི་བགྱིད་དེ་ཞེ་མྱི་སྡང་།
en: No one is my enemy, and I have no hatred.

source: །བདག་ནི་སེམས་ཅན་སྨན་པར་དགའ་བ་ལགས།
en: In my mind there is only delight in benefiting beings. “ ‘When, Prince, I clearly saw

source: །སྐུ་གཞན་སྐུ་མཆོག་ཡོན་ཏན་རབ་མངའ་ཁྱོད། །གང་ཚེ་བདག་གིས་གསལ་བར་མཐོང་གྱུར་པ།
en: You who have a supreme body with excellent qualities,

source: །དེ་ཚེ་དབང་པོ་ཀུན་ཀྱང་ཉམས་སུ་བདེ།
en: All my senses experienced bliss.

source: །རྒྱ་ཆེ་ཡངས་པར་ཤིན་ཏུ་དགའ་བར་གྱུར།
en: There arose within me a vast, great bliss.

source: །ཁྱོད་ཀྱི་དབུ་བཟང་ལྕང་ལོར་འཁྲིལ་བ་ནི།
en: ‘Your coiled hair upon your excellent head

source: །རིན་ཆེན་རྣམ་སྣང་མདོག་ཏུ་མཐོན་ཏིང་གསལ།
en: Is deep blue like the color of a shining jewel.

source: །ཞལ་གྱི་སྨིན་སྡུག་འཕྲལ་བ་ཤངས་སུ་མཛེས།
en: You have lovely eyebrows and a beautiful nose.

source: །ཁྱོད་ཀྱི་ཞལ་སྔར་ལུས་འདི་བདག་འབུལ་ལོ།
en: In your presence I offer you my body. “ ‘You have the supreme signs;

source: །མཚན་གྱི་རབ་འཆང་གཟི་བརྗིད་ཆེ་མངའ་བ།
en: you have excellent radiance.

source: །སྐུ་གཟུགས་གསེར་གྱི་རི་བོ་བཟང་པོ་འདྲ།
en: Your body is like an excellent mountain of gold.

source: །ཁྱོད་ཀྱི་སྤྱན་སྔར་བདག་ལྟ་མི་མཛེས་ཏེ།
en: In your presence, compared to you I have no beauty;

source: །ཟིལ་དུ་རླག་པས་སྣག་ཚའི་གཟུགས་ཀྱང་འདྲ།
en: I am outshone and resemble a solid lump of ink.

source: །སྤྱན་གསལ་རིང་ལ་དཀར་ནག་འབྱེས་པས་མཛེས།
en: ‘Your clear eyes are long, with contrasting white and black.

source: །ཤིན་ཏུ་ཞལ་རྒྱས་སེང་གེའི་ཟ་འགྲམ་ཅན།
en: You have a wide face and the cheeks and jaws of a lion.

source: །ཁྱོད་ཀྱི་གསུང་ནི་ཐོགས་པ་མ་མཆིས་ན།
en: Your speech is free of any impediment.

source: །གསུང་མཆོག་མངའ་བས་བདག་ནི་གཟུང་དུ་གསོལ།
en: I pray that you, who have the supreme speech, take me.

source: །ཁྱོད་ཀྱི་ཞལ་ན་ལྗགས་ཡངས་མངའ་བ་ནི།
en: ‘You have a wide tongue within your mouth.

source: །མདོག་དམར་ཡངས་པ་རིན་ཆེན་མཆོག་གི་འོད།
en: It is wide and red, with the excellent light of a jewel.

source: །ཚངས་དབྱངས་ཡན་ལག་མཆོག་གི་གསུང་མངའ་བས།
en: You possess speech with the supreme aspects of Brahmā’s voice.

source: །གསུང་ཞིང་འགྲོ་བ་རབ་ཏུ་དགའ་བ་མཛད།
en: When you speak, you bring delight to beings.

source: །ཁྱོད་ཀྱི་ཞལ་ན་ཐགས་བཟང་ཚེམས་མངའ་བ།
en: ‘You have even rows of teeth in your mouth,

source: །དུང་ལྟར་དྲི་མེད་ཤིན་ཏུ་རྣམ་པར་གསལ།
en: Very bright and stainless, like conches.

source: །འཛུམ་ཞིང་བཞད་པ་རྣམ་པར་སྟོན་མཛད་ཀྱང་།
en: When you show them in smiling or talking,

source: །སྐྱེས་བུ་དཔལ་ཁྱོད་འགྲོ་བ་དགའ་བར་མཛད།
en: You, glorious man, bring joy to beings.

source: །ཁྱོད་ཀྱི་སྐུ་ལ་མཚན་རབ་མཛེས་པ་རྣམས།
en: ‘Your body is beautified by the thirty-two

source: །སུམ་ཅུ་རྩ་གཉིས་དག་ཅིང་འོད་ཀྱང་གསལ།
en: Supreme signs, and it shines brightly.

source: །སྐུ་གཟུགས་བཟང་པོ་ཡོངས་སུ་དེས་བརྒྱན་པས།
en: As your body is adorned by those signs,

source: །མི་ཡི་དབང་པོ་འཁོར་ལོས་སྒྱུར་བ་བྱོན། །དེ་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོས།
en: Lord of humans, you will be a cakravartin.’

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་ཁྱོད་སུའི།
en: “Then Prince Tejodhipati asked Sucalita­rati­prabhāsa­śrī, ‘Girl, who are you?

source: ཁྱོད་ལ་ཡོངས་སུ་སྲུང་བ་ནི་གང་ཞིག་ཡོད།
en: Who is your guardian?

source: བུ་མོ་ང་ལ་ནི་གཞན་གྱིས་ཡོངས་སུ་གཟུང་བའི་བུད་མེད་བདག་གིར་བྱར་མི་རུང་ངོ་ཞེས་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་སྨྲས་སོ།
en: I cannot take as my own a woman who belongs to another.’ Then at that time he recited these verses:

source: །བལྟ་སྡུག་གཟུགས་ཀྱི་ཡོན་ཏན་ལེགས་ལྡན་པ།
en: ‘You who are beautiful with excellent physical qualities,

source: །མཚན་བཟང་བསོད་ནམས་རྣམ་པར་དག་པའི་ལུས།
en: Who have a pure body of merit with excellent signs,

source: །ཁྱོད་ལ་དྲི་བའི་དོན་འདི་ང་ལ་སྨྲོས།
en: Give your answer to these questions I ask you:

source: །ལུས་མཆོག་ཁྱོད་ནི་སུ་ཡིས་ཡོངས་སུ་གཟུང་།
en: To whom do you, who have a perfect body, belong?

source: །ཁྱོད་ལ་ཕ་དང་མ་ནི་ཡོད་དམ་མྱེད།
en: ‘Do you have a father and mother or not?

source: །ཁྱིམ་ཐབ་མྱེད་དམ་ཁྱོད་ནི་སུ་ཞིག་དབང་།
en: Are you unmarried, or who has authority over you?

source: །གཟུགས་མཛེས་ཁྱོད་ལ་སེམས་ཅན་གཞན་ནམ་གཅིག །བདག་གི་ཡིན་པར་འདུ་ཤེས་བྱེད་མྱེད་དམ།
en: You who have a beautiful body, should I perceive you As belonging to some other being or see you as mine?

source: །ཁྱོད་ཀྱི་ཡིད་ནི་གསོད་ལ་མྱི་དགའ་འགྲང་།
en: ‘In your mind you do not delight in killing?

source: །གཞན་ལས་མ་བྱིན་ཕྲོགས་པར་མི་བྱེད་དམ། །འདོད་པས་ལོག་པར་གཡེམ་ལ་མྱི་དགའ་འགྲང་། །བརྫུན་དུ་བརྗོད་སྨྲར་ཡིད་ནི་མི་མོས་སམ།
en: You do not take from others what is not given? You do not delight in sexual misconduct? You do not wish in your mind to speak lies?

source: །ཁྱོད་ཀྱི་བློ་གྲོས་མཛའ་འབྱེད་མི་འཇུག་གམ།
en: ‘You do not use your intelligence to separate friends?

source: །ཚིག་བརླང་གཞན་ལ་གནོད་པར་མྱི་སྨྲ་འགྲང་།
en: You do not speak harmful words out of anger?

source: །གཞན་གྱི་ནོར་ལ་ཆགས་པར་སེམས་མྱེད་དམ།
en: You do not have a mind that craves the wealth of others?

source: །འགྲོ་བ་རྣམས་ལ་གནོད་པར་མྱི་སེམས་འགྲང་།
en: You do not intend to cause harm to others?

source: །བལྟ་བའི་འབྲོག་དགོན་ལམ་དུ་མ་ཞུགས་འགྲང་།
en: ‘You do not enter the pathways into the wilderness of wrong views?

source: །ལས་ཀྱི་རྒྱུད་ལ་ཡེ་བརྡམ་སེམས་མྱེད་དམ།
en: You are not without restraint in terms of the different kinds of karma?

source: །གཡོ་མདོག་སྒྱུ་ཡི་དབང་དུ་མི་འགྲོའམ།
en: Do you not fall under the power of deceit and trickery?

source: །མི་འཐད་འཇིག་རྟེན་གནོད་པར་མྱི་བྱེད་འགྲང་།
en: Do you not cause wicked harm in the world? “ ‘Are you affectionate and respectful

source: །ཕ་མ་གཉེན་དང་མཛའ་བཤེས་བླ་མ་ལ། །སྲི་ཞུ་རིམ་གྲོར་བྱ་བའི་ཚུལ་འཆང་ངམ། །ཕོངས་པར་གྱུར་པ་ཡོངས་སུ་བསྡུ་དོན་དུ།
en: To father, mother, relatives, friends, and gurus?

source: །ཁྱེད་ཀྱི་ཡིད་ལ་བྱིན་པར་སེམས་ཡོད་དམ།
en: Do you have in your mind the intention to give To gatherings of those who have become destitute? “ ‘Do you have the intention to please the good friends

source: །ཆོས་དང་མཐུན་པར་དུས་སུ་འདོམས་བྱེད་ཅིང་།
en: Who give you timely advice in accord with the Dharma,

source: །ལུས་དང་སེམས་ཡིད་ཡོངས་སུ་དག་བྱེད་ལ།
en: Who make the body and the mind tractable

source: །ཡང་དག་ལས་སུ་རུང་བ་སྐྱེད་བྱེད་པའི།
en: So that they may be completely purified?

source: །དགེ་བཤེས་རྣམས་ལ་དགའ་བར་སེམས་ཡོད་དམ།
en: ‘Do you honor the buddhas?

source: སངས་རྒྱས་རྣམས་ལ་རིམ་གྲོར་བྱེད་ལྡན་ནམ།
en: Do you have great delight in the bodhisattvas?

source: །སངས་རྒྱས་སྲས་ལ་དགའ་མཆོག་ཡོད་དམ་མྱེད།
en: Do you or do you not know the supreme Dharma

source: གང་ལས་བདེ་གཤེགས་སྲས་རྣམས་སྐྱེར་འགྱུར་བའི། །ཆོས་ཀྱི་དམ་པ་དེ་ནི་ཤེས་མི་ཤེས།
en: From which are born the sons of the sugatas?

source: །ཆོས་ཡིད་མཆོག་ལ་གནས་པར་ཁྱོད་བྱེད་འགྲང་།
en: ‘Do you dwell in a supreme Dharma mind?

source: །ཆོས་མིན་སྤྱད་པའི་བློ་གྲོས་མེད་འགྲང་ངོ་།
en: Do you not have a mind that acts contrary to the Dharma? Do you have a perfect mind that respectfully delights

source: །ལེགས་པ་མཐའ་ཡས་ཡོན་ཏན་རྒྱ་མཚོ་ལ།
en: In the ocean of the qualities of infinite excellence?

source: །གུས་པའི་སྲི་ཞུ་དགའ་སེམས་མཆོག་ཡོད་མ།
en: ‘Do you have a kind mind toward those beings

source: །སྐྱེ་བོ་མགོན་མེད་ཕོངས་པར་གྱུར་པ་ཡི།
en: Who have no protector, are destitute, and have no guide?

source: །འདྲེན་པ་རྣམས་ལ་བྱམས་པའི་ཡིད་ཡོད་དམ།
en: Do you have compassion in your mind for those unfortunate ones

source: །ངན་སོང་འགྲོ་བའི་ལམ་ལ་ཞུགས་པ་ཡི།
en: Who have entered the path that leads to the lower existences?

source: །ཤིན་ཏུ་ཉམ་ཐག་སྙིང་རྗེ་སེམས་འགྲང་ངོ་།
en: ‘Do you have perfect rejoicing

source: །གཞན་གྱི་ཕུན་སུམ་ཚོགས་པ་མཐོང་གྱུར་ན། །ཁྱོད་ནི་དགའ་བ་མཆོག་དང་ལྡན་འགྱུར་རམ།
en: When you see the good fortune of others?

source: །སྐྱེ་བོ་ཉོན་མོངས་རྣམས་ཀྱིས་འཁོལ་གྱུར་ལ།
en: When beings are enslaved by their kleśas,

source: །ཤེས་རབ་མཐུ་བསྐྱེད་བཏང་སྙོམས་བྱེད་མི་བྱེད།
en: Do you have equanimity through the power of wisdom, or not?

source: །མྱི་ཤེས་གཉིད་ལོག་སྐྱེ་བོ་མང་མཐོང་ན།
en: ‘When you see many beings in the sleep of ignorance,

source: །བྱང་ཆུབ་དམ་པར་སྨོན་ལམ་འདེབས་བྱེད་འགྲོང་། །བསྐལ་པ་མཐའ་ཡས་སྤྱད་པ་སྤྱོད་བྱེད་ན།
en: Do you pray that they will attain perfect enlightenment?

source: །སྨོན་ལམ་དམ་པས་སྐྱོ་བར་མི་འགྱུར་འགྲང་།
en: Are you not disheartened by the supreme prayer To practice bodhisattva conduct for endless kalpas?’

source: །དེ་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པའི་མ་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པས་རྒྱལ་བུ་གཞོན་ནུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་བདག་གི་བུ་མོ་འདི་ནི་རྫུས་ཏེ་བྱུང་བ།
en: “Then Sudarśanā, the preeminent courtesan, who was the mother of the girl Sucalita­rati­prabhāsa­śrī, said to the young prince Tejodhipati, ‘Prince, this daughter of mine had a miraculous birth;

source: པད་མོའི་ནང་ནས་སྐྱེས་པ་སྟེ།
en: she was born from inside a lotus.

source: སྔན་ཆད་ཁྱིམ་གྱི་ནང་ནས་ཕྱི་རོལ་ཏུ་མ་བྱུང་ངོ་ཞེས་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཅེས་སྨྲས་སོ།
en: She has not until now been outside of her home.’ Then at that time she recited these verses: “ ‘I will give you, in order, the answers

source: །བུ་མོ་འདི་ལ་ཁྱོད་ཀྱིས་གང་སྨྲས་པ།
en: To the questions you have asked this girl.
